In [1]:
import pandas as pd
import numpy as np

In [13]:
dict1 = {
    "Name" : ['Heer','Jivika', 'Kanchan','Namisha','Kusum','Sonia','Anisha','Manisha'],
    "Marks": [92,34,24,89,60,75,80,65],
    "City": ['Mithi','Karachi','Lahore','Islamabad','Kashmir','Sukkur','Kashmoor','Diplo']
}

In [14]:
df=pd.DataFrame(dict1)

In [15]:
df

      Name  Marks       City
0     Heer     92      Mithi
1   Jivika     34    Karachi
2  Kanchan     24     Lahore
3  Namisha     89  Islamabad
4    Kusum     60    Kashmir
5    Sonia     75     Sukkur
6   Anisha     80   Kashmoor
7  Manisha     65      Diplo

In [7]:
data1 = [
    ['Ali',20],
    ['Sara',22],
    ['Ahmed',23]
]
df1 = pd.DataFrame(data1,columns = ['Name', 'Age'])
df1

    Name  Age
0    Ali   20
1   Sara   22
2  Ahmed   23

In [9]:
data2 = [
    ('Suhani', 23),
    ('Ishani', 25),
    ('Sandhya', 27)
]
df2 = pd.DataFrame(data2, columns = ['Name','Age'])
df2

      Name  Age
0   Suhani   23
1   Ishani   25
2  Sandhya   27

In [11]:
data3 = np.array([[1,2],[3,4],[5,6]])
df3 = pd.DataFrame(data3, columns=['A','B'])
df3

   A  B
0  1  2
1  3  4
2  5  6

In [22]:
Data5 = {
    'Age': [18, 20, 19, 22, 21, 20, 23, 19, 18, 22],
    'Height_cm': [160, 165, 162, 170, 168, 166, 172, 161, 159, 171],
    'Weight_kg': [55, 60, 58, 65, 63, 62, 68, 57, 54, 66]  # optional extra column
}
df5 = pd.DataFrame(Data5)
df5

   Age  Height_cm  Weight_kg
0   18        160         55
1   20        165         60
2   19        162         58
3   22        170         65
4   21        168         63
5   20        166         62
6   23        172         68
7   19        161         57
8   18        159         54
9   22        171         66

In [23]:
df5.describe()

            Age   Height_cm  Weight_kg
count  10.00000   10.000000  10.000000
mean   20.20000  165.400000  60.800000
std     1.75119    4.765618   4.779586
min    18.00000  159.000000  54.000000
25%    19.00000  161.250000  57.250000
50%    20.00000  165.500000  61.000000
75%    21.75000  169.500000  64.500000
max    23.00000  172.000000  68.000000

In [12]:
df.to_csv('result.csv')

In [13]:
df.to_excel('result.xlsx')

In [15]:
df.to_csv('trial.csv', index = False)

In [16]:
df.head(2)

     Name  Marks     City
0    Heer     92    Mithi
1  Jivika     34  Karachi

In [17]:
df.tail(2)

      Name  Marks      City
6   Anisha     80  Kashmoor
7  Manisha     65     Diplo

In [18]:
df.head()

      Name  Marks       City
0     Heer     92      Mithi
1   Jivika     34    Karachi
2  Kanchan     24     Lahore
3  Namisha     89  Islamabad
4    Kusum     60    Kashmir

In [19]:
df.tail()

      Name  Marks       City
3  Namisha     89  Islamabad
4    Kusum     60    Kashmir
5    Sonia     75     Sukkur
6   Anisha     80   Kashmoor
7  Manisha     65      Diplo

In [20]:
df.describe()

          Marks
count   8.00000
mean   64.87500
std    24.77578
min    24.00000
25%    53.50000
50%    70.00000
75%    82.25000
max    92.00000

In [4]:
PersonData = pd.read_excel("D:\PythonOnJupyter\Persons'Data.xlsx")

In [31]:
PersonData

    ID    Name  Gender  Age  Height_cm  Weight_kg
0    1     Ali    Male   18        160         55
1    2    Sara  Female   20        165         60
2    3   Ahmed    Male   19        162         58
3    4  Ayesha  Female   22        170         65
4    5   Bilal    Male   40        168         63
5    6    Hina  Female   20        166         62
6    7  Kamran    Male   23        172         68
7    8    Zara  Female   19        161         57
8    9    Omar    Male   18        159         54
9   10    Sana  Female   22        171         66
10  11   David     NaN   28        180         70
11  11   David     NaN   28        180         70
K   11   David     NaN   28        180         70
K   11   David     NaN   28        180         70

In [5]:
PersonData['Age']

0    18
1    20
2    19
3    22
4    21
5    20
6    23
7    19
8    18
9    22
Name: Age, dtype: int64

In [6]:
PersonData['Age'][3]

np.int64(22)

In [7]:
PersonData['Age'][4]=40

C:\Users\DELL\AppData\Local\Temp\ipykernel_13384\4209483046.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  PersonData['Age'][4]=40

In [30]:
PersonData

    ID    Name  Gender  Age  Height_cm  Weight_kg
0    1     Ali    Male   18        160         55
1    2    Sara  Female   20        165         60
2    3   Ahmed    Male   19        162         58
3    4  Ayesha  Female   22        170         65
4    5   Bilal    Male   40        168         63
5    6    Hina  Female   20        166         62
6    7  Kamran    Male   23        172         68
7    8    Zara  Female   19        161         57
8    9    Omar    Male   18        159         54
9   10    Sana  Female   22        171         66
10  11   David     NaN   28        180         70
11  11   David     NaN   28        180         70
K   11   David     NaN   28        180         70
K   11   David     NaN   28        180         70

In [11]:
PersonData = pd.read_excel("D:\PythonOnJupyter\Persons'Data.xlsx")
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg
0           0   1     Ali    Male   18        160         55
1           1   2    Sara  Female   20        165         60
2           2   3   Ahmed    Male   19        162         58
3           3   4  Ayesha  Female   22        170         65
4           4   5   Bilal    Male   40        168         63
5           5   6    Hina  Female   20        166         62
6           6   7  Kamran    Male   23        172         68
7           7   8    Zara  Female   19        161         57
8           8   9    Omar    Male   18        159         54
9           9  10    Sana  Female   22        171         66

In [12]:
PersonData.index= ['A','B','C','D','E','F','G','H','I','J']
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg
A           0   1     Ali    Male   18        160         55
B           1   2    Sara  Female   20        165         60
C           2   3   Ahmed    Male   19        162         58
D           3   4  Ayesha  Female   22        170         65
E           4   5   Bilal    Male   40        168         63
F           5   6    Hina  Female   20        166         62
G           6   7  Kamran    Male   23        172         68
H           7   8    Zara  Female   19        161         57
I           8   9    Omar    Male   18        159         54
J           9  10    Sana  Female   22        171         66

In [13]:
PersonData['BMI']=[24.5, 34.4, 34.1, 31.7, 26.0, 17.4, 18.7, 25.9, 27.2, 30.5]
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1     Ali    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [7]:
Series = pd.Series(np.random.rand(34))
Series

0     0.431455
1     0.021931
2     0.908961
3     0.409184
4     0.824065
5     0.134809
6     0.138507
7     0.251888
8     0.314376
9     0.951538
10    0.751369
11    0.733423
12    0.062779
13    0.868426
14    0.272857
15    0.412566
16    0.824440
17    0.241745
18    0.568547
19    0.597626
20    0.975300
21    0.678218
22    0.516883
23    0.877591
24    0.744282
25    0.166072
26    0.958742
27    0.640490
28    0.060669
29    0.800985
30    0.787155
31    0.160940
32    0.518930
33    0.194745
dtype: float64

In [11]:
Dataframe = pd.DataFrame(np.random.rand(34))
Dataframe

           0
0   0.671087
1   0.926982
2   0.007561
3   0.642879
4   0.008587
5   0.010642
6   0.044632
7   0.258743
8   0.594966
9   0.825994
10  0.666786
11  0.574841
12  0.852909
13  0.663841
14  0.545001
15  0.066936
16  0.239738
17  0.066809
18  0.545370
19  0.865002
20  0.270017
21  0.970408
22  0.934413
23  0.989769
24  0.894231
25  0.685456
26  0.361359
27  0.584827
28  0.273927
29  0.656347
30  0.377624
31  0.966383
32  0.954538
33  0.668317

In [6]:
newdf = pd.DataFrame(np.random.rand(334,5))
newdf

            0         1         2         3         4
0    0.144994  0.259450  0.522866  0.227525  0.913828
1    0.487974  0.094522  0.484349  0.099148  0.637774
2    0.226471  0.216286  0.115984  0.597403  0.473084
3    0.715073  0.821709  0.841666  0.501081  0.483191
4    0.547963  0.563021  0.754778  0.048299  0.490154
..        ...       ...       ...       ...       ...
329  0.021174  0.742603  0.099959  0.867283  0.866900
330  0.545948  0.618348  0.298173  0.145475  0.209198
331  0.365471  0.796723  0.937906  0.409998  0.211535
332  0.543650  0.434339  0.391269  0.883173  0.946933
333  0.899056  0.190336  0.503766  0.845648  0.503086

[334 rows x 5 columns]

In [16]:
PersonData.dtypes

Unnamed: 0      int64
ID              int64
Name           object
Gender         object
Age             int64
Height_cm       int64
Weight_kg       int64
BMI           float64
dtype: object

In [17]:
type(PersonData)

pandas.core.frame.DataFrame

In [19]:
PersonData['Gender'].dtypes

dtype('O')

In [20]:
PersonData.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], dtype='object')

In [21]:
PersonData.columns

Index(['Unnamed: 0', 'ID', 'Name', 'Gender', 'Age', 'Height_cm', 'Weight_kg',
       'BMI'],
      dtype='object')

In [22]:
 newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.144994,0.487974,0.226471,0.715073,0.547963,0.084986,0.893464,0.689952,0.032718,0.796509,...,0.276855,0.461895,0.370119,0.166153,0.749170,0.021174,0.545948,0.365471,0.543650,0.899056
1,0.259450,0.094522,0.216286,0.821709,0.563021,0.496346,0.145042,0.275912,0.356706,0.698960,...,0.900525,0.922119,0.152640,0.276136,0.538820,0.742603,0.618348,0.796723,0.434339,0.190336
2,0.522866,0.484349,0.115984,0.841666,0.754778,0.705842,0.487962,0.785837,0.815962,0.541094,...,0.770627,0.774873,0.199425,0.172678,0.893135,0.099959,0.298173,0.937906,0.391269,0.503766
3,0.227525,0.099148,0.597403,0.501081,0.048299,0.083776,0.943194,0.319485,0.960556,0.983855,...,0.286039,0.727028,0.810664,0.023304,0.797695,0.867283,0.145475,0.409998,0.883173,0.845648
4,0.913828,0.637774,0.473084,0.483191,0.490154,0.794004,0.703465,0.092306,0.661320,0.264825,...,0.134453,0.837081,0.312283,0.729062,0.566874,0.866900,0.209198,0.211535,0.946933,0.503086

In [23]:
PersonData.T

,A,B,C,D,E,F,G,H,I,J
Unnamed: 0,0,1,2,3,4,5,6,7,8,9
ID,1,2,3,4,5,6,7,8,9,10
Name,Ali,Sara,Ahmed,Ayesha,Bilal,Hina,Kamran,Zara,Omar,Sana
Gender,Male,Female,Male,Female,Male,Female,Male,Female,Male,Female
Age,18,20,19,22,40,20,23,19,18,22
Height_cm,160,165,162,170,168,166,172,161,159,171
Weight_kg,55,60,58,65,63,62,68,57,54,66
BMI,24.5,34.4,34.1,31.7,26.0,17.4,18.7,25.9,27.2,30.5

In [27]:
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1     Ali    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [29]:
PersonData.T

,A,B,C,D,E,F,G,H,I,J
Unnamed: 0,0,1,2,3,4,5,6,7,8,9
ID,1,2,3,4,5,6,7,8,9,10
Name,Ali,Sara,Ahmed,Ayesha,Bilal,Hina,Kamran,Zara,Omar,Sana
Gender,Male,Female,Male,Female,Male,Female,Male,Female,Male,Female
Age,18,20,19,22,40,20,23,19,18,22
Height_cm,160,165,162,170,168,166,172,161,159,171
Weight_kg,55,60,58,65,63,62,68,57,54,66
BMI,24.5,34.4,34.1,31.7,26.0,17.4,18.7,25.9,27.2,30.5

In [30]:
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1     Ali    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [32]:
PersonData.sort_index(ascending = False)

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
J           9  10    Sana  Female   22        171         66  30.5
I           8   9    Omar    Male   18        159         54  27.2
H           7   8    Zara  Female   19        161         57  25.9
G           6   7  Kamran    Male   23        172         68  18.7
F           5   6    Hina  Female   20        166         62  17.4
E           4   5   Bilal    Male   40        168         63  26.0
D           3   4  Ayesha  Female   22        170         65  31.7
C           2   3   Ahmed    Male   19        162         58  34.1
B           1   2    Sara  Female   20        165         60  34.4
A           0   1     Ali    Male   18        160         55  24.5

In [33]:
PersonData.sort_index(axis = 1, ascending = False)

   Weight_kg  Unnamed: 0    Name  ID  Height_cm  Gender   BMI  Age
A         55           0     Ali   1        160    Male  24.5   18
B         60           1    Sara   2        165  Female  34.4   20
C         58           2   Ahmed   3        162    Male  34.1   19
D         65           3  Ayesha   4        170  Female  31.7   22
E         63           4   Bilal   5        168    Male  26.0   40
F         62           5    Hina   6        166  Female  17.4   20
G         68           6  Kamran   7        172    Male  18.7   23
H         57           7    Zara   8        161  Female  25.9   19
I         54           8    Omar   9        159    Male  27.2   18
J         66           9    Sana  10        171  Female  30.5   22

In [34]:
MyDf = PersonData
MyDf['Name'][0] = 'Sajid'
MyDf

C:\Users\DELL\AppData\Local\Temp\ipykernel_7804\1075973671.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  MyDf['Name'][0] = 'Sajid'
C:\Users\DELL\AppData\Local\Temp\ipykernel_7804\1075973671.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  MyDf['Name'][0] = 'Sajid'
C:\Users\DELL\AppData\Local\Temp\ipykernel_7804\1075973671.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  MyDf['Name'][0] = 'Sajid'

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1   Sajid    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [35]:
PersonData

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1   Sajid    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [38]:
OurDf = MyDf.copy()
OurDf['Name'][1] = 'Nata'
OurDf

C:\Users\DELL\AppData\Local\Temp\ipykernel_7804\3929347501.py:2: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  OurDf['Name'][1] = 'Nata'
C:\Users\DELL\AppData\Local\Temp\ipykernel_7804\3929347501.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  OurDf['Name'][1] = 'Nata'
C:\Users\DELL\AppData\Local\Temp\ipykernel_7804\3929347501.py:2: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  OurDf['Name'][1] = 'Nata'

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1   Sajid    Male   18        160         55  24.5
B           1   2    Nata  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [39]:
MyDf

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
A           0   1   Sajid    Male   18        160         55  24.5
B           1   2    Sara  Female   20        165         60  34.4
C           2   3   Ahmed    Male   19        162         58  34.1
D           3   4  Ayesha  Female   22        170         65  31.7
E           4   5   Bilal    Male   40        168         63  26.0
F           5   6    Hina  Female   20        166         62  17.4
G           6   7  Kamran    Male   23        172         68  18.7
H           7   8    Zara  Female   19        161         57  25.9
I           8   9    Omar    Male   18        159         54  27.2
J           9  10    Sana  Female   22        171         66  30.5

In [44]:
PersonData.loc['B','Gender']

'Female'

In [48]:
PersonData.loc[(PersonData['Gender']== 'Female')& (PersonData['Height_cm']>165)]

   Unnamed: 0  ID    Name  Gender  Age  Height_cm  Weight_kg   BMI
D           3   4  Ayesha  Female   22        170         65  31.7
F           5   6    Hina  Female   20        166         62  17.4
J           9  10    Sana  Female   22        171         66  30.5

In [71]:
PersonData.loc[['A','E'],['Name','Gender']]

    Name Gender
A  Sajid   Male
E  Bilal   Male

In [72]:
PersonData.loc[['B','C'],:]

   Unnamed: 0  ID   Name  Gender  Age  Height_cm  Weight_kg   BMI
B           1   2   Sara  Female   20        165         60  34.4
C           2   3  Ahmed    Male   19        162         58  34.1

In [73]:
PersonData.loc[:,['Name','Gender']]

     Name  Gender
A   Sajid    Male
B    Sara  Female
C   Ahmed    Male
D  Ayesha  Female
E   Bilal    Male
F    Hina  Female
G  Kamran    Male
H    Zara  Female
I    Omar    Male
J    Sana  Female

In [67]:
OurDf.columns = ['Index', 'Roll_no.', 'FullName', 'Gender', 'YearsOld', 'Height', 'Weight', 'BMIs']
OurDf

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
H      7         8     Zara  Female        19     161      57  25.9
I      8         9     Omar    Male        18     159      54  27.2
J      9        10     Sana  Female        22     171      66  30.5

In [59]:
OurDf.iloc[0:5,0:3]

   Index  Roll_no. FullName
A      0         1    Sajid
B      1         2     Nata
C      2         3    Ahmed
D      3         4   Ayesha
E      4         5    Bilal

In [74]:
OurDf.iloc[:,0:3]

   Index  Roll_no. FullName
A      0         1    Sajid
B      1         2     Nata
C      2         3    Ahmed
D      3         4   Ayesha
E      4         5    Bilal
F      5         6     Hina
G      6         7   Kamran
H      7         8     Zara
I      8         9     Omar
J      9        10     Sana

In [75]:
OurDf.iloc[0:5,:]

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0

In [76]:
OurDf.iloc[3,5]

np.int64(170)

In [77]:
OurDf.iloc[:,:]

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
H      7         8     Zara  Female        19     161      57  25.9
I      8         9     Omar    Male        18     159      54  27.2
J      9        10     Sana  Female        22     171      66  30.5

In [80]:
OurDf.iloc[[1,5],[2,6]]

  FullName  Weight
B     Nata      60
F     Hina      62

In [78]:
OurDf.iloc[0:4,3]

A      Male
B    Female
C      Male
D    Female
Name: Gender, dtype: object

In [79]:
OurDf.iloc[4,0:3]

Index           4
Roll_no.        5
FullName    Bilal
Name: E, dtype: object

In [60]:
OurDf.shape

(10, 8)

In [61]:
OurDf.size

80

In [62]:
OurDf.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, A to J
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Index     10 non-null     int64
 1   Roll_no.  10 non-null     int64
 2   FullName  10 non-null     object
 3   Gender    10 non-null     object
 4   YearsOld  10 non-null     int64
 5   Height    10 non-null     int64
 6   Weight    10 non-null     int64
 7   BMIs      10 non-null     float64
dtypes: float64(1), int64(5), object(2)
memory usage: 1020.0+ bytes

In [69]:
OurDf[['FullName','Gender','YearsOld']]

  FullName  Gender  YearsOld
A    Sajid    Male        18
B     Nata  Female        20
C    Ahmed    Male        19
D   Ayesha  Female        22
E    Bilal    Male        40
F     Hina  Female        20
G   Kamran    Male        23
H     Zara  Female        19
I     Omar    Male        18
J     Sana  Female        22

OurDf['FullName','Gender','YearsOld']

In [70]:
OurDf

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
H      7         8     Zara  Female        19     161      57  25.9
I      8         9     Omar    Male        18     159      54  27.2
J      9        10     Sana  Female        22     171      66  30.5

In [83]:
OurDf['FullName'].value_counts()

FullName
Sajid     1
Nata      1
Ahmed     1
Ayesha    1
Bilal     1
Hina      1
Kamran    1
Zara      1
Omar      1
Sana      1
Name: count, dtype: int64

In [85]:
OurDf.loc['H','FullName']='Nata'
OurDf

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
H      7         8     Nata  Female        19     161      57  25.9
I      8         9     Omar    Male        18     159      54  27.2
J      9        10     Sana  Female        22     171      66  30.5

In [88]:
OurDf['FullName'].value_counts()

Weight
55    1
60    1
58    1
65    1
63    1
62    1
68    1
57    1
54    1
66    1
Name: count, dtype: int64

In [89]:
OurDf.value_counts()

Index  Roll_no.  FullName  Gender  YearsOld  Height  Weight  BMIs
0      1         Sajid     Male    18        160     55      24.5    1
1      2         Nata      Female  20        165     60      34.4    1
2      3         Ahmed     Male    19        162     58      34.1    1
3      4         Ayesha    Female  22        170     65      31.7    1
4      5         Bilal     Male    40        168     63      26.0    1
5      6         Hina      Female  20        166     62      17.4    1
6      7         Kamran    Male    23        172     68      18.7    1
7      8         Nata      Female  19        161     57      25.9    1
8      9         Omar      Male    18        159     54      27.2    1
9      10        Sana      Female  22        171     66      30.5    1
Name: count, dtype: int64

In [90]:
OurDf.notnull()

   Index  Roll_no.  FullName  Gender  YearsOld  Height  Weight  BMIs
A   True      True      True    True      True    True    True  True
B   True      True      True    True      True    True    True  True
C   True      True      True    True      True    True    True  True
D   True      True      True    True      True    True    True  True
E   True      True      True    True      True    True    True  True
F   True      True      True    True      True    True    True  True
G   True      True      True    True      True    True    True  True
H   True      True      True    True      True    True    True  True
I   True      True      True    True      True    True    True  True
J   True      True      True    True      True    True    True  True

In [91]:
OurDf

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid    Male        18     160      55  24.5
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
H      7         8     Nata  Female        19     161      57  25.9
I      8         9     Omar    Male        18     159      54  27.2
J      9        10     Sana  Female        22     171      66  30.5

In [99]:
FilteredPeople = OurDf.query("YearsOld > 19 and Weight >= 60 and Height < 170 ")
FilteredPeople

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
B      1         2     Nata  Female        20     165      60  34.4
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4

In [104]:
FilteredGender = OurDf[OurDf['Gender'].isin(['Male'])]
FilteredGender

   Index  Roll_no. FullName Gender  YearsOld  Height  Weight  BMIs
A      0         1    Sajid   Male        18     160      55  24.5
C      2         3    Ahmed   Male        19     162      58  34.1
E      4         5    Bilal   Male        40     168      63  26.0
G      6         7   Kamran   Male        23     172      68  18.7
I      8         9     Omar   Male        18     159      54  27.2

In [105]:
FilteredHeight = OurDf[OurDf['Height'] > 165]
FilteredHeight

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
G      6         7   Kamran    Male        23     172      68  18.7
J      9        10     Sana  Female        22     171      66  30.5

In [106]:
FilteredData = OurDf[(OurDf['Height'] > 165) & (OurDf['Gender'] == 'Female')]
FilteredData

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
D      3         4   Ayesha  Female        22     170      65  31.7
F      5         6     Hina  Female        20     166      62  17.4
J      9        10     Sana  Female        22     171      66  30.5

In [107]:
Agg_Values = OurDf.groupby('FullName')['Height'].agg(['sum','mean'])
Agg_Values

          sum   mean
FullName
Ahmed     162  162.0
Ayesha    170  170.0
Bilal     168  168.0
Hina      166  166.0
Kamran    172  172.0
Nata      326  163.0
Omar      159  159.0
Sajid     160  160.0
Sana      171  171.0

In [113]:
SortedValues = OurDf.sort_values(by ='Height', ascending = False)
SortedValues

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
G      6         7   Kamran    Male        23     172      68  18.7
J      9        10     Sana  Female        22     171      66  30.5
D      3         4   Ayesha  Female        22     170      65  31.7
E      4         5    Bilal    Male        40     168      63  26.0
F      5         6     Hina  Female        20     166      62  17.4
B      1         2     Nata  Female        20     165      60  34.4
C      2         3    Ahmed    Male        19     162      58  34.1
H      7         8     Nata  Female        19     161      57  25.9
A      0         1    Sajid    Male        18     160      55  24.5
I      8         9     Omar    Male        18     159      54  27.2

In [114]:
SortedValues2 = OurDf.sort_values(by ='Height', ascending = True)
SortedValues2

   Index  Roll_no. FullName  Gender  YearsOld  Height  Weight  BMIs
I      8         9     Omar    Male        18     159      54  27.2
A      0         1    Sajid    Male        18     160      55  24.5
H      7         8     Nata  Female        19     161      57  25.9
C      2         3    Ahmed    Male        19     162      58  34.1
B      1         2     Nata  Female        20     165      60  34.4
F      5         6     Hina  Female        20     166      62  17.4
E      4         5    Bilal    Male        40     168      63  26.0
D      3         4   Ayesha  Female        22     170      65  31.7
J      9        10     Sana  Female        22     171      66  30.5
G      6         7   Kamran    Male        23     172      68  18.7

In [118]:
OurDf = OurDf.rename(columns = {'YearsOld':'Age'})
OurDf

   Index  Roll_no. FullName  Gender  Age  Height  Weight  BMIs
A      0         1    Sajid    Male   18     160      55  24.5
B      1         2     Nata  Female   20     165      60  34.4
C      2         3    Ahmed    Male   19     162      58  34.1
D      3         4   Ayesha  Female   22     170      65  31.7
E      4         5    Bilal    Male   40     168      63  26.0
F      5         6     Hina  Female   20     166      62  17.4
G      6         7   Kamran    Male   23     172      68  18.7
H      7         8     Nata  Female   19     161      57  25.9
I      8         9     Omar    Male   18     159      54  27.2
J      9        10     Sana  Female   22     171      66  30.5

In [120]:
OurDf['FullName'] = OurDf['FullName'].replace('Omar','Sajid')
OurDf

   Index  Roll_no. FullName  Gender  Age  Height  Weight  BMIs
A      0         1    Sajid    Male   18     160      55  24.5
B      1         2     Nata  Female   20     165      60  34.4
C      2         3    Ahmed    Male   19     162      58  34.1
D      3         4   Ayesha  Female   22     170      65  31.7
E      4         5    Bilal    Male   40     168      63  26.0
F      5         6     Hina  Female   20     166      62  17.4
G      6         7   Kamran    Male   23     172      68  18.7
H      7         8     Nata  Female   19     161      57  25.9
I      8         9    Sajid    Male   18     159      54  27.2
J      9        10     Sana  Female   22     171      66  30.5